In [17]:
#imports
import pandas as pd
import numpy as np

In [18]:
#assign data to variables
title_basics_url = "https://datasets.imdbws.com/title.basics.tsv.gz"
title_akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"
title_ratings_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

In [71]:
#read variable to dataframe
basics = pd.read_csv(title_basics_url,sep='\t', low_memory=False)

In [20]:
#read variable to dataframe
akas = pd.read_csv(title_akas_url,sep='\t', low_memory=False)

In [21]:
#read variable to dataframe
ratings = pd.read_csv(title_ratings_url,sep='\t', low_memory=False)

In [72]:
#view basics df
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [73]:
#view datatypes of basics df
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9149170 entries, 0 to 9149169
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 628.2+ MB

In [74]:
#replace \n with NaN
basics = basics.replace({'\\N':np.nan})
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [75]:
basics['startYear']  = basics['startYear'].astype('float')

In [59]:
basics['startYear']  = basics['startYear'].astype('int')

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [76]:
#view datatypes of basics df to confirm startYear changed to float
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9149170 entries, 0 to 9149169
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       float64
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: float64(1), object(8)
memory usage: 628.2+ MB

In [77]:
basics.value_counts('startYear')

startYear
2021.0    423347
2018.0    419624
2017.0    416866
2019.0    407023
2016.0    395747
           ...
1881.0         2
1878.0         2
1885.0         1
1883.0         1
1874.0         1
Length: 150, dtype: int64

In [78]:
#run value_counts on titleType to see spelling of values 
basics.value_counts('titleType')

titleType
tvEpisode       6890147
short            884294
movie            618534
video            264219
tvSeries         229623
tvMovie          137196
tvMiniSeries      44710
tvSpecial         37961
videoGame         31851
tvShort           10633
tvPilot               2
dtype: int64

In [45]:
akas = akas.replace({'\\N':np.nan})
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [46]:
ratings = ratings.replace({'\\N':np.nan})
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517

In [79]:
#filter basics df where 'runtimeMinutes' does not equal NaN
basics = basics[basics['runtimeMinutes'] != 'NaN'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"

In [80]:
#filter basics df where 'genres'' does not equal NaN
basics = basics[basics['genres'] != 'NaN'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,NaN,1,"Comedy,Short"

In [81]:
#filter basics df where 'titleType'' equals 'movie'
basics = basics[basics['titleType'] == 'movie'] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894.0,NaN,45,Romance
498,tt0000502,movie,Bohemios,Bohemios,0,1905.0,NaN,100,NaN
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906.0,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907.0,NaN,90,Drama
610,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907.0,NaN,NaN,Drama

In [82]:
basics = basics[basics['startYear'] == 2000.0] 
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
15174,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000.0,NaN,60,NaN
100036,tt0102362,movie,Istota,Istota,0,2000.0,NaN,80,"Drama,Romance"
105245,tt0107706,movie,Nothing,Nothing,0,2000.0,NaN,NaN,NaN
110439,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
110496,tt0113086,movie,Florentino y el diablo,Florentino y el diablo,0,2000.0,NaN,NaN,Drama

In [83]:
akas.value_counts('region')

region
FR    3920723
JP    3920182
DE    3903654
IN    3848159
ES    3843915
       ...
PW          1
NR          1
TC          1
TV          1
NU          1
Length: 246, dtype: int64

In [84]:
akas = akas[akas['region'] == 'US'] 
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [90]:
basics1 = basics[basics['genres'].str.contains("Documentary")==True]
basics1.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
117563,tt0120454,movie,Vinyl,Vinyl,0,2000.0,NaN,110,Documentary
126851,tt0130458,movie,Anikó,Anikó,0,2000.0,NaN,70,Documentary
133250,tt0137210,movie,Siestas & Olas: A Surfing Journey Through Mexico,Siestas & Olas: A Surfing Journey Through Mexico,0,2000.0,NaN,87,"Documentary,Sport"
140558,tt0144940,movie,Fé,Fé,0,2000.0,NaN,91,Documentary
146725,tt0151372,movie,Ljuset håller mig sällskap,Ljuset håller mig sällskap,0,2000.0,NaN,78,Documentary

In [91]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics['tconst'].isin(akas['titleId'])
keepers

15174      False
100036     False
105245     False
110439      True
110496     False
           ...
9071214    False
9074223    False
9078969     True
9093977    False
9110678    False
Name: tconst, Length: 5139, dtype: bool

In [92]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
110439,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
110502,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"
113248,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama
113687,tt0116391,movie,Gang,Gang,0,2000.0,NaN,167,"Action,Crime,Drama"
113913,tt0116628,movie,The Incorporated,The Incorporated,0,2000.0,NaN,86,"Action,Thriller"
...,...,...,...,...,...,...,...,...,...
8836043,tt9242918,movie,Great White Shark: Truth Behind the Legend,Great White Shark: Truth Behind the Legend,0,2000.0,NaN,75,Documentary
8911342,tt9404778,movie,Split Second,Split Second,0,2000.0,NaN,NaN,Drama
8914924,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action
8958660,tt9505726,movie,Escort,Ya jie de gu shi,0,2000.0,NaN,NaN,Drama
9078969,tt9765426,movie,Hammering It Out,Hammering It Out,0,2000.0,NaN,NaN,NaN

In [93]:
# example making new folder with os
import os
os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
os.listdir("Data/")

[]

In [94]:
## Save current dataframe to file.
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [95]:
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86.0,"Musical,Romance"
1,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100.0,"Action,Adventure,Drama"
2,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91.0,Drama
3,tt0116391,movie,Gang,Gang,0,2000.0,NaN,167.0,"Action,Crime,Drama"
4,tt0116628,movie,The Incorporated,The Incorporated,0,2000.0,NaN,86.0,"Action,Thriller"

In [99]:
## Save current dataframe to file.
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [100]:
# Open saved file and preview again
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [101]:
## Save current dataframe to file.
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [102]:
# Open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.9       256
2  tt0000003            6.5      1702
3  tt0000004            5.7       168
4  tt0000005            6.2      2517